------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_3/code/Workshop_3.log
  log type:  text
 opened on:  14 Jun 2019, 11:53:15

. set more off

. 
. ******************************************
. *   Load data & labeling                 *
. ******************************************
. 
. use "$path/raw_data/LemieuxMilligan.dta", clear

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. lab var empc mean employment
invalid syntax
r(198);

end of do-file
r(198);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. lab var empc "mean employment"

. 
end of do-file
-> . -> -> do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T
> //SD01340.000000"

. lab var empc "mean employment"

. lab var quebec "dummy for Quebec residents"

. lab var year "year of the data, 1986 or 1991"

. lab var age "relevant ages 20-39"

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. lab var nobs "number of observations in the cell"

. 
end of do-file
-> . -> do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//S
> D01340.000000"

. twoway scatter empc age if quebec==1 & year==1986, xline(30)

. graph export "/graphs/fig1.png", replace
--Break--
r(1);

end of do-file
r(1);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. eststo lr_1 :  reg empc age treat if age>=25 & quebec==1 & ye
> ar==1986 [weight=nobs]
(analytic weights assumed)
variable treat not found
r(111);

end of do-file
r(111);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. gen treat = (age>=30)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. twoway scatter empc age if quebec==1 & year==1986, xline(30)

. graph export "graphs/Fig1.eps", replace
(note: file graphs/Fig1.eps not found)
(file graphs/Fig1.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. gen treat = (age>=30)
variable treat already defined
r(110);

end of do-file
r(110);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01
> 340.000000"

. eststo lr_1 :  reg empc age treat if age>=25 & quebec==1 & ye
> ar==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)

      Source |       SS           df       MS      Number of ob
> s   =        15
-------------+----------------------------------   F(2, 12)    
>     =    128.31
       Model |  .037410697         2  .018705349   Prob > F    
>     =    0.0000
    Residual |  .001749428        12  .000145786   R-squared   
>     =    0.9553
-------------+----------------------------------   Adj R-square
> d   =    0.9479
       Total |  .039160126        14  .002797152   Root MSE    
>     =    .01207

---------------------------------------------------------------
> ---------------
        empc |      Coef.   Std. Err.      t    P>|t|     [95% 
> Con                                                          
>    f. Interval]
-------------+-------------------------------------------------
> ---------------
         age |  -.0075741   .0013688    -5.53   0.000    -.0105
> 564                                                          
>       -.0045917
       treat |   -.040147   .0115181    -3.49   0.004    -.0652
> 427                                                          
>       -.0150513
       _cons |   .8679936   .0369553    23.49   0.000      .787
> 475                                                          
>        .9485122
---------------------------------------------------------------
> ---------------

. eststo lr_1_r: reg empc age treat if age>=25 & quebec==1 & ye
> ar==1986 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs  
>    =         15
                                                F(2, 12)       
>    =     131.82
                                                Prob > F       
>    =     0.0000
                                                R-squared      
>    =     0.9553
                                                Root MSE       
>    =     .01207

---------------------------------------------------------------
> ---------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% 
> Con                                                          
>    f. Interval]
-------------+-------------------------------------------------
> ---------------
         age |  -.0075741   .0011073    -6.84   0.000    -.0099
> 867                                                          
>       -.0051614
       treat |   -.040147   .0103372    -3.88   0.002    -.0626
> 697                                                          
>       -.0176243
       _cons |   .8679936   .0301048    28.83   0.000     .8024
> 008                                                          
>        .9335864
---------------------------------------------------------------
> ---------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo lr_1 :  reg empc age treat if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(2, 12)        =    128.31
       Model |  .037410697         2  .018705349   Prob > F        =    0.0000
    Residual |  .001749428        12  .000145786   R-squared       =    0.9553
-------------+----------------------------------   Adj R-squared   =    0.9479
       Total |  .039160126        14  .002797152   Root MSE        =    .01207

------------------------------------------------------------------------------
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0075741   .0013688    -5.53   0.000    -.0105564   -.0045917
       treat |   -.040147   .0115181    -3.49   0.004    -.0652427   -.0150513
       _cons |   .8679936   .0369553    23.49   0.000      .787475    .9485122
------------------------------------------------------------------------------

. eststo lr_1_r: reg empc age treat if age>=25 & quebec==1 & year==1986 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     131.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9553
                                                Root MSE          =     .01207

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0075741   .0011073    -6.84   0.000    -.0099867   -.0051614
       treat |   -.040147   .0103372    -3.88   0.002    -.0626697   -.0176243
       _cons |   .8679936   .0301048    28.83   0.000     .8024008    .9335864
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_sq=age^2

. gen age_cu=age^3

. 
. eststo lr_2: reg empc age age_sq treat if age>=25 & quebec==1 & year==1986 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(3, 11)          =     161.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9649
                                                Root MSE          =     .01117

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0156457   .0104981     1.49   0.164    -.0074604    .0387518
      age_sq |  -.0003532   .0001586    -2.23   0.048    -.0007023   -4.14e-06
       treat |  -.0504839   .0080237    -6.29   0.000    -.0681439   -.0328239
       _cons |    .500074   .1704673     2.93   0.014     .1248781    .8752699
------------------------------------------------------------------------------

. eststo lr_3: reg empc age age_sq age_cu treat if age>=25 & quebec==1 & year==1986 [weight=nobs], r 
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(4, 10)          =     125.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9656
                                                Root MSE          =     .01161

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0832036    .132715     0.63   0.545    -.2125039    .3789111
      age_sq |  -.0025455   .0042996    -0.59   0.567    -.0121255    .0070345
      age_cu |   .0000233   .0000458     0.51   0.621    -.0000787    .0001254
       treat |  -.0478323   .0087849    -5.44   0.000    -.0674062   -.0282584
       _cons |  -.1847201   1.352003    -0.14   0.894     -3.19717     2.82773
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. eststo lr_donut1: reg empc age treat if age>=25 & quebec==1 & year==1986 & age!=30 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 20,864)

Linear regression                               Number of obs     =         14
                                                F(2, 11)          =     132.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9583
                                                Root MSE          =     .01221

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0068591   .0013416    -5.11   0.000    -.0098119   -.0039063
       treat |  -.0471277   .0127403    -3.70   0.004    -.0751689   -.0190864
       _cons |   .8488276   .0364427    23.29   0.000     .7686178    .9290374
------------------------------------------------------------------------------

. eststo lr_donut2: reg empc age age_sq treat if age>=25 & quebec==1 & year==1986 & age!=30 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 20,864)

Linear regression                               Number of obs     =         14
                                                F(3, 10)          =     179.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9676
                                                Root MSE          =     .01129

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0159592   .0109589     1.46   0.176    -.0084587     .040377
      age_sq |  -.0003477   .0001658    -2.10   0.062    -.0007171    .0000218
       treat |  -.0569444   .0098179    -5.80   0.000      -.07882   -.0350688
       _cons |   .4876715   .1783851     2.73   0.021     .0902047    .8851382
------------------------------------------------------------------------------

. eststo lr_donut3: reg empc age age_sq age_cu treat if age>=25 & quebec==1 & year==1986 & age!=30 [weight=nobs] 
(analytic weights assumed)
(sum of wgt is 20,864)

      Source |       SS           df       MS      Number of obs   =        14
-------------+----------------------------------   F(4, 9)         =     67.25
       Model |  .038056464         4  .009514116   Prob > F        =    0.0000
    Residual |  .001273323         9   .00014148   R-squared       =    0.9676
-------------+----------------------------------   Adj R-squared   =    0.9532
       Total |  .039329787        13  .003025368   Root MSE        =    .01189

------------------------------------------------------------------------------
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0052104   .1928849     0.03   0.979    -.4311255    .4415463
      age_sq |   1.75e-06   .0062569     0.00   1.000    -.0141524    .0141559
      age_cu |  -3.72e-06   .0000666    -0.06   0.957    -.0001543    .0001468
       treat |  -.0576209    .019201    -3.00   0.015    -.1010567   -.0141851
       _cons |   .5962626   1.956656     0.30   0.767        -3.83    5.022525
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_ge30=treat*age

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg empc age treat*age treat if age>=25 & quebec==1 & year==1986 [weight=nobs], r
(analytic weights assumed)
variable treat*age not found
r(111);

end of do-file
r(111);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen treat_age=treat*age

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg empc age age_ge30 treat if age>=25 & quebec==1 & year==1986 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(3, 11)          =     170.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9680
                                                Root MSE          =     .01068

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0023984   .0022292    -1.08   0.305    -.0073049     .002508
    age_ge30 |  -.0064046   .0024141    -2.65   0.022     -.011718   -.0010911
       treat |   .1402318   .0706447     1.99   0.073    -.0152561    .2957197
       _cons |   .7292526   .0631533    11.55   0.000      .590253    .8682521
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. expand 21 if quebec==1 & year==1986 & age==20
(20 observations created)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. matrix b=e(b)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. matrix list b

b[1,4]
           age    age_ge30       treat       _cons
y1  -.00239844  -.00640456   .14023182   .72925256

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_plot=age*(_n<=80)+(age+80-_n)*(_n>80)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen empc_hat0_q4=b[1,4]+b[1,1]*age_plot

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen empc_hat1_q4=b[1,4]+(b[1,1]+b[1,2])*age_plot+b[1,3]

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. twoway (line empc_hat0_q4 age_plot, sort) (line empc_hat1_q4 age_plot, sort) if quebec==1 & year==1986, xline(30)

. graph export "graphs/fig5.png", replace
(file graphs/fig5.png written in PNG format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. twoway (line empc_hat0_q4 age_plot, sort) (line empc_hat1_q4 age_plot, sort) if quebec==1 & year==1986, xline(30)

. graph export "graphs/fig5.png", replace
(file graphs/fig5.png written in PNG format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. *Empci = B0 +B1(age -30)+ B2(age - 30)*treat + B3treat +ui (2)
. gen age_mc     = age-30

. gen age_mc_ge30= treat*age_mc

. 
. eststo lr_5: reg empc age_mc age_mc_ge30 treat if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(3, 11)        =    110.79
       Model |  .037905601         3    .0126352   Prob > F        =    0.0000
    Residual |  .001254525        11  .000114048   R-squared       =    0.9680
-------------+----------------------------------   Adj R-squared   =    0.9592
       Total |  .039160126        14  .002797152   Root MSE        =    .01068

------------------------------------------------------------------------------
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      age_mc |  -.0023984   .0027638    -0.87   0.404    -.0084816    .0036847
 age_mc_ge30 |  -.0064046   .0030745    -2.08   0.061    -.0131714    .0003623
       treat |  -.0519049   .0116466    -4.46   0.001    -.0775388    -.026271
       _cons |   .6572994   .0096446    68.15   0.000     .6360718    .6785271
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. predict empc_hat_q6
(option xb assumed; fitted values)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. twoway (scatter empc age) (line empc_hat_q6 age if age <30, sort) ///
>                                                   (line empc_hat_q6 age if age >=30, sort) ////
>                                                   if age>=25 & quebec==1 & year==1986, xline(30)

. graph export "graphs/fig3.eps", replace
(note: file graphs/fig3.eps not found)
(file graphs/fig3.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_mc_sq=age_treat^2
age_treat not found
r(111);

end of do-file
r(111);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_mc_sq=age_mc^2

. gen age_mc_treat_sq=treat*age_mc^2

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen age_mc_sq=age_mc^2
variable age_mc_sq already defined
r(110);

end of do-file
r(110);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_ge30_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
variable age_mc_ge30_sq not found
r(111);

end of do-file
r(111);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(4, 10)        =     70.42
       Model |  .037817643         4  .009454411   Prob > F        =    0.0000
    Residual |  .001342483        10  .000134248   R-squared       =    0.9657
-------------+----------------------------------   Adj R-squared   =    0.9520
       Total |  .039160126        14  .002797152   Root MSE        =    .01159

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -.0077298   .0049356    -1.57   0.148     -.018727    .0032673
      age_mc_sq |  -.0007741   .0009122    -0.85   0.416    -.0028066    .0012584
age_mc_treat_sq |   .0006649   .0014019     0.47   0.646    -.0024588    .0037886
age_mc_treat_sq |          0  (omitted)
          treat |   -.045904   .0159219    -2.88   0.016    -.0813802   -.0104277
          _cons |   .6497004   .0095836    67.79   0.000     .6283467    .6710541
---------------------------------------------------------------------------------

. predict empc_hat_q7_1
(option xb assumed; fitted values)

. 
. twoway (scatter empc age) (line empc_hat_q7_1 age if age<30, sort) ///
>                                                   (line empc_hat_q7_1 age if age>=30, sort) ///
>                                                    if age>=25 & quebec==1 & year==1986, xline(30)          

. graph export "graphs/fig4.eps", replace
(note: file graphs/fig4.eps not found)
(file graphs/fig4.eps written in EPS format)

. 
. reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                  if quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 95,652)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(4, 35)        =    332.17
       Model |  .078912951         4  .019728238   Prob > F        =    0.0000
    Residual |  .002078743        35  .000059393   R-squared       =    0.9743
-------------+----------------------------------   Adj R-squared   =    0.9714
       Total |  .080991694        39   .00207671   Root MSE        =    .00771

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |    -.02018   .0026558    -7.60   0.000    -.0255716   -.0147885
      age_mc_sq |  -.0029408    .000204   -14.42   0.000    -.0033549   -.0025266
age_mc_treat_sq |   .0041717   .0005065     8.24   0.000     .0031434       .0052
age_mc_treat_sq |          0  (omitted)
          treat |  -.0202451   .0119617    -1.69   0.099    -.0445287    .0040386
          _cons |   .6408749   .0076505    83.77   0.000     .6253436    .6564061
---------------------------------------------------------------------------------

. predict empc_hat_q7_2
(option xb assumed; fitted values)

. 
. twoway (scatter empc age) (line empc_hat_q7_2 age if age<30, sort) ///
>                                               (line empc_hat_q7_2 age if age>=30, sort) ///
>                                                    if quebec==1 & year==1986, xline(30)

. graph export "graphs/fig5.eps", replace
(note: file graphs/fig5.eps not found)
(file graphs/fig5.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(4, 10)        =     70.42
       Model |  .037817643         4  .009454411   Prob > F        =    0.0000
    Residual |  .001342483        10  .000134248   R-squared       =    0.9657
-------------+----------------------------------   Adj R-squared   =    0.9520
       Total |  .039160126        14  .002797152   Root MSE        =    .01159

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -.0077298   .0049356    -1.57   0.148     -.018727    .0032673
      age_mc_sq |  -.0007741   .0009122    -0.85   0.416    -.0028066    .0012584
age_mc_treat_sq |   .0006649   .0014019     0.47   0.646    -.0024588    .0037886
age_mc_treat_sq |          0  (omitted)
          treat |   -.045904   .0159219    -2.88   0.016    -.0813802   -.0104277
          _cons |   .6497004   .0095836    67.79   0.000     .6283467    .6710541
---------------------------------------------------------------------------------

. predict empc_hat_q7_1
variable empc_hat_q7_1 already defined
r(110);

end of do-file
r(110);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(4, 10)        =     70.42
       Model |  .037817643         4  .009454411   Prob > F        =    0.0000
    Residual |  .001342483        10  .000134248   R-squared       =    0.9657
-------------+----------------------------------   Adj R-squared   =    0.9520
       Total |  .039160126        14  .002797152   Root MSE        =    .01159

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -.0077298   .0049356    -1.57   0.148     -.018727    .0032673
      age_mc_sq |  -.0007741   .0009122    -0.85   0.416    -.0028066    .0012584
age_mc_treat_sq |   .0006649   .0014019     0.47   0.646    -.0024588    .0037886
age_mc_treat_sq |          0  (omitted)
          treat |   -.045904   .0159219    -2.88   0.016    -.0813802   -.0104277
          _cons |   .6497004   .0095836    67.79   0.000     .6283467    .6710541
---------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(4, 10)        =     70.42
       Model |  .037817643         4  .009454411   Prob > F        =    0.0000
    Residual |  .001342483        10  .000134248   R-squared       =    0.9657
-------------+----------------------------------   Adj R-squared   =    0.9520
       Total |  .039160126        14  .002797152   Root MSE        =    .01159

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -.0077298   .0049356    -1.57   0.148     -.018727    .0032673
      age_mc_sq |  -.0007741   .0009122    -0.85   0.416    -.0028066    .0012584
age_mc_treat_sq |   .0006649   .0014019     0.47   0.646    -.0024588    .0037886
age_mc_treat_sq |          0  (omitted)
          treat |   -.045904   .0159219    -2.88   0.016    -.0813802   -.0104277
          _cons |   .6497004   .0095836    67.79   0.000     .6283467    .6710541
---------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo lr_6: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if age>=25 & quebec==1 & year==1986 [weight=nobs]
(analytic weights assumed)
(sum of wgt is 22,511)
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        15
-------------+----------------------------------   F(4, 10)        =     70.42
       Model |  .037817643         4  .009454411   Prob > F        =    0.0000
    Residual |  .001342483        10  .000134248   R-squared       =    0.9657
-------------+----------------------------------   Adj R-squared   =    0.9520
       Total |  .039160126        14  .002797152   Root MSE        =    .01159

---------------------------------------------------------------------------------
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -.0077298   .0049356    -1.57   0.148     -.018727    .0032673
      age_mc_sq |  -.0007741   .0009122    -0.85   0.416    -.0028066    .0012584
age_mc_treat_sq |   .0006649   .0014019     0.47   0.646    -.0024588    .0037886
age_mc_treat_sq |          0  (omitted)
          treat |   -.045904   .0159219    -2.88   0.016    -.0813802   -.0104277
          _cons |   .6497004   .0095836    67.79   0.000     .6283467    .6710541
---------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo lr_7: reg empc age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat ///
>                                                    if quebec==1 & year==1986 [weight=nobs], r
(analytic weights assumed)
(sum of wgt is 95,652)
note: age_mc_treat_sq omitted because of collinearity

Linear regression                               Number of obs     =         40
                                                F(4, 35)          =     187.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9743
                                                Root MSE          =     .00771

---------------------------------------------------------------------------------
                |               Robust
           empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |    -.02018   .0035899    -5.62   0.000     -.027468   -.0128921
      age_mc_sq |  -.0029408   .0002979    -9.87   0.000    -.0035456    -.002336
age_mc_treat_sq |   .0041717   .0007194     5.80   0.000     .0027112    .0056321
age_mc_treat_sq |          0  (omitted)
          treat |  -.0202451   .0128397    -1.58   0.124    -.0463111     .005821
          _cons |   .6408749   .0081423    78.71   0.000     .6243452    .6574045
---------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg nobs age_mc age_mc_sq age_mc_treat age_mc_treat_sq treat if quebec==1 & year==1986
note: age_mc_treat_sq omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(4, 35)        =   1960.39
       Model |  24498575.3         4  6124643.82   Prob > F        =    0.0000
    Residual |  109347.121        35  3124.20345   R-squared       =    0.9956
-------------+----------------------------------   Adj R-squared   =    0.9950
       Total |  24607922.4        39  630972.369   Root MSE        =    55.895

---------------------------------------------------------------------------------
           nobs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
         age_mc |  -264.1341   16.50208   -16.01   0.000    -297.6351   -230.6331
      age_mc_sq |  -13.49129   1.305354   -10.34   0.000     -16.1413   -10.84128
age_mc_treat_sq |   32.93163   3.057103    10.77   0.000     26.72538    39.13788
age_mc_treat_sq |          0  (omitted)
          treat |   110.7361    74.4898     1.49   0.146    -40.48628    261.9584
          _cons |   1642.818   46.82639    35.08   0.000     1547.755     1737.88
---------------------------------------------------------------------------------

. 
. predict nobs_hat_q8
(option xb assumed; fitted values)

. 
. twoway (scatter nobs age) (line nobs_hat_q8 age if age<30, sort) ///
>                                                   (line nobs_hat_q8 age if age>=30, sort) ///
>                                                   if quebec==1 & year==1986, xline(30)

. graph export "graphs/fig6.eps", replace
(note: file graphs/fig6.eps not found)
(file graphs/fig6.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo clear

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. foreach i of numlist 27/33 {
  2.  gen placebo`i' = (age>=`i')
  3.  reg empc age placebo`i' if age>=25 & quebec==1 & year==1986 [weight=nobs],r
  4.  eststo placebo`i'
  5. }
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     152.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9248
                                                Root MSE          =     .01567

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0127835     .00101   -12.66   0.000    -.0149842   -.0105828
   placebo27 |   .0189621   .0095618     1.98   0.071    -.0018713    .0397955
       _cons |   .9914163   .0259769    38.17   0.000     .9348175    1.048015
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     116.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9130
                                                Root MSE          =     .01685

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0122899   .0014728    -8.34   0.000     -.015499   -.0090809
   placebo28 |   .0085885    .015605     0.55   0.592    -.0254118    .0425888
       _cons |   .9852915   .0380226    25.91   0.000     .9024474    1.068136
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     113.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9121
                                                Root MSE          =     .01694

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0108645   .0021246    -5.11   0.000    -.0154936   -.0062354
   placebo29 |  -.0076921   .0210307    -0.37   0.721    -.0535141    .0381298
       _cons |   .9522727   .0560017    17.00   0.000     .8302554     1.07429
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     131.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9553
                                                Root MSE          =     .01207

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0075741   .0011073    -6.84   0.000    -.0099867   -.0051614
   placebo30 |   -.040147   .0103372    -3.88   0.002    -.0626697   -.0176243
       _cons |   .8679936   .0301048    28.83   0.000     .8024008    .9335864
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     161.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9341
                                                Root MSE          =     .01467

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0083877   .0017185    -4.88   0.000    -.0121319   -.0046435
   placebo31 |  -.0315818   .0176118    -1.79   0.098    -.0699545     .006791
       _cons |   .8860969   .0438302    20.22   0.000      .790599    .9815948
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     146.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9181
                                                Root MSE          =     .01635

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0097048   .0020303    -4.78   0.000    -.0141284   -.0052813
   placebo32 |  -.0190403   .0209977    -0.91   0.382    -.0647903    .0267098
       _cons |   .9194851   .0533646    17.23   0.000     .8032137    1.035757
------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 22,511)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =     102.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9113
                                                Root MSE          =     .01702

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0122765   .0018802    -6.53   0.000     -.016373   -.0081799
   placebo33 |   .0074106   .0185935     0.40   0.697    -.0331011    .0479223
       _cons |   .9884038     .05134    19.25   0.000     .8765435    1.100264
------------------------------------------------------------------------------

. estout, cells(b(star fmt(3)) t(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend

----------------------------------------------------------------------------------------------------------------------------
                placebo27       placebo28       placebo29       placebo30       placebo31       placebo32       placebo33   
                      b/t             b/t             b/t             b/t             b/t             b/t             b/t   
----------------------------------------------------------------------------------------------------------------------------
age                -0.013***       -0.012***       -0.011***       -0.008***       -0.008***       -0.010***       -0.012***
                 (-12.66)         (-8.34)         (-5.11)         (-6.84)         (-4.88)         (-4.78)         (-6.53)   
placebo27           0.019*                                                                                                  
                   (1.98)                                                                                                   
placebo28                           0.009                                                                                   
                                   (0.55)                                                                                   
placebo29                                          -0.008                                                                   
                                                  (-0.37)                                                                   
placebo30                                                          -0.040***                                                
                                                                  (-3.88)                                                   
placebo31                                                                          -0.032*                                  
                                                                                  (-1.79)                                   
placebo32                                                                                          -0.019                   
                                                                                                  (-0.91)                   
placebo33                                                                                                           0.007   
                                                                                                                   (0.40)   
_cons               0.991***        0.985***        0.952***        0.868***        0.886***        0.919***        0.988***
                  (38.17)         (25.91)         (17.00)         (28.83)         (20.22)         (17.23)         (19.25)   
----------------------------------------------------------------------------------------------------------------------------
* p<0.10, ** p<0.05, *** p<0.01

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo clear

. 
. foreach i of numlist 27/33 {
  2.  gen placebo`i' = (age>=`i')
  3.  reg empc age placebo`i' if age>=25 & quebec==1 & year==1986 [weight=nobs],r
  4.  eststo placebo`i'
  5. }
variable placebo27 already defined
r(110);

end of do-file
r(110);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. estout, cells(b(star fmt(3)) t(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend

----------------------------
                        .   
                      b/t   
----------------------------
age                -0.012***
                  (-6.53)   
placebo33           0.007   
                   (0.40)   
_cons               0.988***
                  (19.25)   
----------------------------
* p<0.10, ** p<0.05, *** p<0.01

. estout using "results/table2.xls",, cells(b(star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend
invalid 'cells' 
r(198);

end of do-file
r(198);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. estout, cells(b(star fmt(3)) t(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend

----------------------------
                        .   
                      b/t   
----------------------------
age                -0.012***
                  (-6.53)   
placebo33           0.007   
                   (0.40)   
_cons               0.988***
                  (19.25)   
----------------------------
* p<0.10, ** p<0.05, *** p<0.01

. estout using "results/table2.xls",, cells(b(star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend
invalid 'cells' 
r(198);

end of do-file
r(198);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo clear

. eststo quebec1991:    reg empc age treat if age>=25 & quebec==1 & year==1991 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 21,962)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =       3.59
                                                Prob > F          =     0.0601
                                                R-squared         =     0.4381
                                                Root MSE          =     .02393

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0075229   .0029422    -2.56   0.025    -.0139334   -.0011123
       treat |   .0404126   .0248147     1.63   0.129     -.013654    .0944792
       _cons |   .8187574     .08174    10.02   0.000     .6406612    .9968537
------------------------------------------------------------------------------

. eststo restCanad1986: reg empc age treat if age>=25 & quebec==0 & year==1986 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 57,779)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =      76.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8839
                                                Root MSE          =     .00593

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0019859    .000723    -2.75   0.018    -.0035612   -.0004107
       treat |  -.0135241   .0068783    -1.97   0.073    -.0285107    .0014625
       _cons |   .7766502   .0193994    40.03   0.000     .7343825    .8189178
------------------------------------------------------------------------------

. eststo restCanad1991: reg empc age treat if age>=25 & quebec==0 & year==1991 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 61,175)

Linear regression                               Number of obs     =         15
                                                F(2, 12)          =       1.29
                                                Prob > F          =     0.3107
                                                R-squared         =     0.2267
                                                Root MSE          =     .01202

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0018594   .0012763    -1.46   0.171    -.0046403    .0009214
       treat |    .005093   .0098486     0.52   0.614    -.0163652    .0265511
       _cons |    .731116   .0364547    20.06   0.000     .6516881     .810544
------------------------------------------------------------------------------

. 
. estout, cells(b(star fmt(3)) t(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend

------------------------------------------------------------
               quebec1991    restCan~1986    restCan~1991   
                      b/t             b/t             b/t   
------------------------------------------------------------
age                -0.008**        -0.002**        -0.002   
                  (-2.56)         (-2.75)         (-1.46)   
treat               0.040          -0.014*          0.005   
                   (1.63)         (-1.97)          (0.52)   
_cons               0.819***        0.777***        0.731***
                  (10.02)         (40.03)         (20.06)   
------------------------------------------------------------
* p<0.10, ** p<0.05, *** p<0.01

. estout using "results/table2.xls", cells(b(star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend
(output written to results/table2.xls)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen treatDiD   = (age<=29)*(quebec==1)*(year==1986)

. /*Notice that here we define the treatment as having a lower benefit level
> whereas we in the regression discontinuity  analysis defined the treatment as
> having a higher benefit level*/
. gen placeboDiD = (age>=30)*(quebec==1)*(year==1986)

. gen y1986 = (year==1986)

. gen age29 = (age<=29)

. 
. eststo clear

. 
. eststo DiD_age_le29: /// Empc = B0 + B1_Quebec + B2_Year=1986 + B3_Quebec*Year=1986 + u
>                                                 reg empc quebec y1986 treatDiD if age<=29 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 240,155)

Linear regression                               Number of obs     =         60
                                                F(3, 56)          =      18.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5757
                                                Root MSE          =     .04362

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      quebec |  -.0408202   .0164387    -2.48   0.016     -.073751   -.0078894
       y1986 |   .0524394   .0207253     2.53   0.014     .0109217    .0939572
    treatDiD |  -.0769564   .0234354    -3.28   0.002    -.1239031   -.0300096
       _cons |   .6403769   .0149374    42.87   0.000     .6104537    .6703001
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo DiD_age_le29: /// Empc = B0 + B1_Quebec + B2_Year=1986 + B3_Quebec*Year=1986 + u
>                                                 reg empc quebec y1986 treatDiD if age<=29 [weight=nobs],
(analytic weights assumed)
(sum of wgt is 240,155)

      Source |       SS           df       MS      Number of obs   =        60
-------------+----------------------------------   F(3, 56)        =     25.33
       Model |  .144577268         3  .048192423   Prob > F        =    0.0000
    Residual |  .106554772        56  .001902764   R-squared       =    0.5757
-------------+----------------------------------   Adj R-squared   =    0.5530
       Total |   .25113204        59  .004256475   Root MSE        =    .04362

------------------------------------------------------------------------------
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      quebec |  -.0408202   .0229595    -1.78   0.081    -.0868135    .0051731
       y1986 |   .0524394   .0150177     3.49   0.001     .0223554    .0825235
    treatDiD |  -.0769564   .0267884    -2.87   0.006    -.1306201   -.0232927
       _cons |   .6403769   .0111901    57.23   0.000     .6179605    .6627933
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo DiD_age_le29: /// Empc = B0 + B1_Quebec + B2_Year=1986 + B3_Quebec*Year=1986 + u
>                                                 reg empc quebec y1986 treatDiD if age<=29 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 240,155)

Linear regression                               Number of obs     =         60
                                                F(3, 56)          =      18.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5757
                                                Root MSE          =     .04362

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      quebec |  -.0408202   .0164387    -2.48   0.016     -.073751   -.0078894
       y1986 |   .0524394   .0207253     2.53   0.014     .0109217    .0939572
    treatDiD |  -.0769564   .0234354    -3.28   0.002    -.1239031   -.0300096
       _cons |   .6403769   .0149374    42.87   0.000     .6104537    .6703001
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo DiDplacebo_age_ge30: /// If we have parallel trends, we should expect that B3 is zero.
>                                                 reg empc quebec y1986 placeboDiD if age>=30 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 86,638)

Linear regression                               Number of obs     =         40
                                                F(3, 36)          =      65.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8489
                                                Root MSE          =     .01979

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      quebec |  -.0700498   .0120164    -5.83   0.000    -.0944201   -.0456795
       y1986 |   .0224867   .0049716     4.52   0.000     .0124037    .0325696
  placeboDiD |  -.0543876   .0157092    -3.46   0.001    -.0862473    -.022528
       _cons |   .6731749   .0036273   185.59   0.000     .6658184    .6805313
------------------------------------------------------------------------------

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo DiD_1986: ///
>                                                 reg empc quebec age29 treatDiD if year==1986 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 199,740)

Linear regression                               Number of obs     =         60
                                                F(3, 56)          =      99.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6895
                                                Root MSE          =      .0413

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      quebec |  -.1244374   .0099362   -12.52   0.000     -.144342   -.1045328
       age29 |  -.0028452   .0147499    -0.19   0.848    -.0323927    .0267023
    treatDiD |   .0066608   .0194349     0.34   0.733    -.0322719    .0455935
       _cons |   .6956615   .0033387   208.36   0.000     .6889733    .7023498
------------------------------------------------------------------------------

.                                                 
. /*Here, the identifying assumption is that the differences in the labor market 
> conditions between individuals aged below and above age 30 are similar in Quebec
> and the rest of Canada. In this case, we estimate a significant effects of 6,8%
> points, which is significant at 5 percent*/
. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. eststo DiD_Quebec: ///
>                                                 reg empc y1986 age29 treatDiD if quebec==1 [weight=nobs],r
(analytic weights assumed)
(sum of wgt is 127,721)

Linear regression                               Number of obs     =         60
                                                F(3, 56)          =       3.39
                                                Prob > F          =     0.0241
                                                R-squared         =     0.0729
                                                Root MSE          =      .0426

------------------------------------------------------------------------------
             |               Robust
        empc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       y1986 |   -.031901   .0146332    -2.18   0.033    -.0612147   -.0025872
       age29 |  -.0035684   .0131778    -0.27   0.788    -.0299668      .02283
    treatDiD |    .007384   .0182705     0.40   0.688    -.0292162    .0439842
       _cons |   .6031251   .0112494    53.61   0.000     .5805898    .6256603
------------------------------------------------------------------------------

. 
. estout, cells(b(star fmt(3)) t(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend

----------------------------------------------------------------------------
             DiD_age_le29    DiDplaceb~30        DiD_1986      DiD_Quebec   
                      b/t             b/t             b/t             b/t   
----------------------------------------------------------------------------
quebec             -0.041**        -0.070***       -0.124***                
                  (-2.48)         (-5.83)        (-12.52)                   
y1986               0.052**         0.022***                       -0.032** 
                   (2.53)          (4.52)                         (-2.18)   
treatDiD           -0.077***                        0.007           0.007   
                  (-3.28)                          (0.34)          (0.40)   
placeboDiD                         -0.054***                                
                                  (-3.46)                                   
age29                                              -0.003          -0.004   
                                                  (-0.19)         (-0.27)   
_cons               0.640***        0.673***        0.696***        0.603***
                  (42.87)        (185.59)        (208.36)         (53.61)   
----------------------------------------------------------------------------
* p<0.10, ** p<0.05, *** p<0.01

. estout using "results/table3.xls", cells(b(star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend
(output written to results/table3.xls)

. 
. /*Here, the identifying assumption is that the local labor market conditions in 
> Quebec were aected similarly for persons aged below and above 30 years between 
> 1986 and 1991. We obtain an estimate of 6,9 % points, which is significant at 1%*/
. 
end of do-file
-> . install jive
command install is unrecognized
r(199);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. use "$path/raw_data/Angrist_Krueger.do", clear
file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_3/raw_data/Angrist_Krueger.do not found
r(601);

end of do-file
r(601);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. use "$path/raw_data/AngristKrueger1991.do", clear
file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_3/raw_data/AngristKrueger1991.do not found
r(601);

end of do-file
r(601);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. 
. ******************************************
. *   Initial options                      *
. ******************************************
. 
. cls

. clear all

. cap log c
